## Python Basics

### Question 1 (5 points)
**Complete the function `str_cmp` to return `True` if two strings are the same irrespective of lowercase/uppercase and whitespaces. Else, return `False`.**

In [1]:
def str_cmp(str_1, str_2):
    str_1new=str_1.replace(" ","").lower()
    str_2new=str_2.replace(" ","").lower()
    return str_1new==str_2new

In [2]:
# TEST CASES -- DO NOT MODIFY

# Test Case 1
assert str_cmp("csce", "csce") == True, "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert str_cmp("csce", "csce412") == False, "Failed test case 2"
print("Passed test case 2\n" + "="*20)

# Test Case 3
assert str_cmp("MaChine LeArnIng", "machine learning") == True, "Failed test case 3"
print("Passed test case 3\n" + "="*20)

# Test Case 4
assert str_cmp("Machine Learning!", "Machine Learning") == False, "Failed test case 4"
print("Passed test case 4\n" + "="*20)

# Test Case 5
assert str_cmp("  Machine Learning", "machine    Learning ") == True, "Failed test case 5"
print("Passed test case 5\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
Passed test case 3
====================
Passed test case 4
====================
Passed test case 5
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 2 (5 points)
**Complete the function `power_list` in which each element is raised by its index to create a new list. Return the sum of the elements of the new list.**  

Example:  
given list: [1, 2, 3, 4]  
new list: [1, 2, 9, 64]  
sum of the elements of new list: 76

In [3]:
import numpy as np

In [4]:
def power_list(arr):
    sum_list=[x**i for i,x in enumerate(arr)]
    return np.sum(sum_list)

In [5]:
# TEST CASES -- DO NOT MODIFY

# Test Case 1
assert power_list([i for i in range(5)]) == 289, "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert power_list([-i for i in range(10, -1, -1)]) == 48, "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 3 (10 points)
**Complete the function `create_stats` that returns the mean and median values of the values arranged in a nested list.**

In [6]:
import statistics

def create_stats(universities):
    """
    Return a tuple of (mean students enrolled, median students enrolled, mean tuition, median tuition)
    Return a tuple of (mean cars sold, median cars sold, mean MSRP, median MSRP)
    """
    enrolled = [entry[1] for entry in universities]
    mean_enrolled = np.sum(enrolled)/len(enrolled)
    n=len(enrolled)
    enrolled.sort()
    if n % 2 == 0:
       median_enrolled = (enrolled[n // 2 - 1] + enrolled[n // 2]) / 2
    else:
        median_enrolled = enrolled[n // 2]




    tuition = [entry[2] for entry in universities]
    mean_tuition = np.sum(tuition)/len(tuition)
    n=len(tuition)
    tuition.sort()
    if n % 2 == 0:
       median_tuition = (tuition[n // 2 - 1] + tuition[n // 2]) / 2
    else:
        median_tuition = tuition[n // 2]

    return (mean_enrolled, median_enrolled, mean_tuition, median_tuition)

In [7]:
# TEST CASES -- DO NOT MODIFY

# [[university name, students enrolled, tuition]]
universities = [
    ["Harvard", 19627, 39849],
    ["Massachusetts Institute of Technology", 10566, 40732],
    ["Princeton", 7806, 37000],
    ["Rice", 5870, 35551],
    ["Stanford", 19539, 40569],
    ["Yale", 11706, 40500],
]



# [[model, cars sold, MSRP]]
cars = [
    ["Ford F-series", 52314, 35000],
    ["Toyota RAV4", 41145, 30000],
    ["Honda CR-V", 31530, 32000],
    ["Toyota Camry", 32959, 28000],
    ["Honda Civic", 28318, 23000]
]

# Test Case 1
assert create_stats(universities) == (12519.0, 11136.0, 39033.5, 40174.5), "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert create_stats(cars) == (37253.2, 32959, 29600.0, 30000), "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

# NumPy Basics

In [8]:
import numpy as np

### Question 4 (5 points)
**Complete the function `matrix_reshape` to reshape a matrix to the target dimensions given by `n_rows` and `n_cols`.**

In [9]:
def matrix_reshape(mat, n_rows, n_cols):
    reshaped=np.reshape(mat,(n_rows,n_cols))
    return reshaped

In [10]:
# TEST CASES -- DO NOT MODIFY

A = np.array([
    [3, -4, 2, 9],
    [6, 1, -5, 2],
    [-7, 8, -1, 6]
])

# Test Case 1
assert (matrix_reshape(np.arange(15), 3, 5) == np.array([[ 0,  1,  2,  3,  4], [ 5,  6,  7,  8,  9],
                                                            [10, 11, 12, 13, 14]])).all(), "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert (matrix_reshape(A, 2, 6) == np.array([[ 3, -4,  2,  9,  6,  1],
       [-5,  2, -7,  8, -1,  6]])).all(), "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 5 (5 points)
**Complete the function `dot_product` that returns the dot product of two matrices. Dot product is also known as matrix multiplication.**

In [11]:
def dot_product(mat_1, mat_2):
    return(np.dot(mat_1,mat_2))

In [12]:
# TEST CASES -- DO NOT MODIFY

A = np.array([
    [3, -4, 2, 9],
    [6, 1, -5, 2],
    [-7, 8, -1, 6]
])

# Test Case 1
assert dot_product(A[0,:], A[1,:]) == 22, "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert (dot_product(A[0,:], A.T) == np.array([110,  22,  -1])).all(), "Failed test case 2"
print("Passed test case 2\n" + "="*20)

# Test Case 3
assert (dot_product(A, A.T) == np.array([[110,  22,  -1], [ 22,  66, -17],
                                               [ -1, -17, 150]])).all(), "Failed test case 3"
print("Passed test case 3\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
Passed test case 3
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 6 (5 points)
**Complete the function `cross_product` that returns the cross product of two matrices.**

In [13]:
def cross_product(mat_1, mat_2):
    return(np.cross(mat_1,mat_2))

In [14]:
# TEST CASES -- DO NOT MODIFY

A = np.array([
    [3, -4, 2, 9],
    [6, 1, -5, 2],
    [-7, 8, -1, 6]
])

# Test Case 1
assert cross_product(A[0,:2], A[:2,1]) == -13, "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert cross_product(A[:2,:2], A[2:,2:])[0] == 14, "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 7 (5 points)
**Complete the function `inverse` that computes the inverse of a matrix.**

In [15]:
def inverse(mat):
    return(np.linalg.inv(mat))

In [16]:
# TEST CASES -- DO NOT MODIFY

A = np.array([
    [6, 1, 1],
    [4, -2, 5],
    [2, 8, 7]
])

# Test Case 1
assert np.allclose(inverse(A), np.array([[ 0.17647059, -0.00326797, -0.02287582],
       [ 0.05882353, -0.13071895,  0.08496732],
       [-0.11764706,  0.1503268 ,  0.05228758]])), "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert (inverse(A[:2,:2]) == np.array([[ 0.125 ,  0.0625],
       [ 0.25  , -0.375 ]])).all(), "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 8 (10 points)
**Complete the function `subtract_mean` that subtracts the row-wise mean from each row of a matrix.**

In [17]:
def subtract_mean(mat):
    mat=mat.astype(float)
    row_mean=(np.mean(mat,axis=1))
    new_mat=mat.copy()
    for i in range(mat.shape[0]):
      new_mat[i]=new_mat[i]-row_mean[i]
    return new_mat

In [18]:
A = np.array([
    [3, -4, 2, 9],
    [6, 1, -5, 2],
    [-7, 8, -1, 6]
])

# Test Case 1
assert (subtract_mean(np.arange(12).reshape(4,3)) == np.array([[-1.,  0.,  1.], [-1.,  0.,  1.],
       [-1.,  0.,  1.], [-1.,  0.,  1.]])).all(), "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert (subtract_mean(A) == np.array([[0.5, -6.5, -0.5,  6.5], [5. ,  0. , -6. ,  1. ],
        [-8.5,  6.5, -2.5,  4.5]])).all(), "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

### Question 9 (10 points)
**Complete the function `moving_average` that computes averages over a sliding window of size `window_size` for a 1-D array.**

In [19]:
def moving_average(arr, window_size):
    i = 0
    moving_averages = []

    while i < len(arr) - window_size + 1:

        window = arr[i : i + window_size]
        window_average = np.sum(window) / window_size

        moving_averages.append(window_average)

        i += 1

    return moving_averages

In [20]:
# Test Case 1
assert (moving_average(np.arange(10), 3) == np.arange(8)+1).all(), "Failed test case 1"
print("Passed test case 1\n" + "="*20)

# Test Case 2
assert (moving_average(np.array([-10, 5, 6, -4, 7, 9]), 2) ==
        np.array([-2.5, 5.5, 1, 1.5, 8])).all(), "Failed test case 2"
print("Passed test case 2\n" + "="*20)

print("*"*29 + "\n**  PASSED ALL TEST CASES  **\n" + "*"*29)

Passed test case 1
====================
Passed test case 2
====================
*****************************
**  PASSED ALL TEST CASES  **
*****************************

# Pandas Basics

In [21]:
import pandas as pd


**Data**

In [22]:
data = {'From': ['delhi', 'Lucknow', 'delhi',
                   'Mumbai', 'Chennai'],
        'To': ['Hyderabad', 'Kochi', 'Chandigarh', 'Hyderabad', 'Kolkata'],
        'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
        'Delay_1': [23, np.nan, 24, 13, 67],
        'Delay_2': [47, np.nan, 43, np.nan, 32],
        'Delay_3': [np.nan, np.nan, 87, np.nan, np.nan],
        'Airline': ['Air India', 'Indigo', 'Go Air',
                    'Indigo', 'Vistara']}

In [23]:
df = pd.DataFrame(data)

In [24]:
df.head()

      From          To  FlightNumber  Delay_1  Delay_2  Delay_3    Airline
0    delhi   Hyderabad       10045.0     23.0     47.0      NaN  Air India
1  Lucknow       Kochi           NaN      NaN      NaN      NaN     Indigo
2    delhi  Chandigarh       10065.0     24.0     43.0     87.0     Go Air
3   Mumbai   Hyderabad           NaN     13.0      NaN      NaN     Indigo
4  Chennai     Kolkata       10085.0     67.0     32.0      NaN    Vistara

### Question 10 (5 points)
**Calculate the number of unique cities in `df`.**

In [25]:
cities=[]
for i in range(0,5):
   cities.append(df['From'][i])
   cities.append(df['To'][i])

count=len(np.unique(cities))
print(count)

8

### Question 11 (5 points)
**Compute the no. of flights flying out of `Delhi`.**

In [26]:
## YOUR CODE HERE
from_delhi=df['From'].value_counts()['delhi']
print(from_delhi)

2

### Question 12 (5 points)
**Which cities are served by `Indigo`?**

In [27]:
df.head()

      From          To  FlightNumber  Delay_1  Delay_2  Delay_3    Airline
0    delhi   Hyderabad       10045.0     23.0     47.0      NaN  Air India
1  Lucknow       Kochi           NaN      NaN      NaN      NaN     Indigo
2    delhi  Chandigarh       10065.0     24.0     43.0     87.0     Go Air
3   Mumbai   Hyderabad           NaN     13.0      NaN      NaN     Indigo
4  Chennai     Kolkata       10085.0     67.0     32.0      NaN    Vistara

In [28]:
# print((df.loc[df.index[df["From"]=="Lucknow"]])['To'])

In [29]:
## YOUR CODE HERE
from_cities=[]
to_cities=[]
index=df.index[df['Airline'] == 'Indigo'].tolist()
for i in index:
  from_cities.append(df['From'][i])
  to_cities.append(df['To'][i])
print("From Cities:  ",from_cities)
print("To Cities:  ",to_cities)

From Cities:   ['Lucknow', 'Mumbai']
To Cities:   ['Kochi', 'Hyderabad']

### Question 13 (5 points)
**Calculate the total number of missing values (they are `NaN`) in `df`.**

In [30]:
## YOUR CODE HERE
print(df.isna().sum().sum())

9

### Task 14 (10 points)
**Compute the average delay, disregarding any `NaN` values, across all flights. Subsequently, update `df` by substituting all `NaN` values within the `Delay_1`, `Delay_2`, and `Delay_3` columns with this computed average delay.**

In [31]:
# YOUR CODE HERE
avg = df[['Delay_1', 'Delay_2', 'Delay_3']].mean(skipna=True)
average=avg.mean()
df = pd.DataFrame(data)
df1=df.copy()
df1['Delay_1'] = df['Delay_1'].fillna(average)
df2 = df1.copy()
df2['Delay_2'] = df1['Delay_2'].fillna(average)
df3=df2.copy()
df3['Delay_3'] = df2['Delay_3'].fillna(average)
df=df3.copy()

In [32]:
df.head()

,From,To,FlightNumber,Delay_1,Delay_2,Delay_3,Airline
0,delhi,Hyderabad,10045.0,23.000000,47.000000,53.138889,Air India
1,Lucknow,Kochi,NaN,53.138889,53.138889,53.138889,Indigo
2,delhi,Chandigarh,10065.0,24.000000,43.000000,87.000000,Go Air
3,Mumbai,Hyderabad,NaN,13.000000,53.138889,53.138889,Indigo
4,Chennai,Kolkata,10085.0,67.000000,32.000000,53.138889,Vistara

### Task 15 (10 points)
**Fill in missing values in the `FlightNumber` column. The `FlightNumber` is expected to increase by 10 with each subsequent row. For instance, at row indices 1 and 3, the `FlightNumber` should be 10055 and 10075 respectively. Adjust the `df` to incorporate these changes and convert the column to integer type.**

In [33]:
## YOUR CODE HERE
index1=df.loc[pd.isna(df['FlightNumber']), :].index.tolist()
for i in index1:
  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10

df['FlightNumber']=df['FlightNumber'].astype(int)
print(df)

      From          To  FlightNumber    Delay_1    Delay_2    Delay_3  \
0    delhi   Hyderabad         10045  23.000000  47.000000  53.138889
1  Lucknow       Kochi         10055  53.138889  53.138889  53.138889
2    delhi  Chandigarh         10065  24.000000  43.000000  87.000000
3   Mumbai   Hyderabad         10075  13.000000  53.138889  53.138889
4  Chennai     Kolkata         10085  67.000000  32.000000  53.138889

     Airline
0  Air India
1     Indigo
2     Go Air
3     Indigo
4    Vistara

C:\Users\Aayush\AppData\Local\Temp\ipykernel_59096\759912295.py:4: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10
C:\Users\Aayush\AppData\Local\Temp\ipykernel_59096\759912295.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10
C:\Users\Aayush\AppData\Local\Temp\ipykernel_59096\759912295.py:4: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10
C:\Users\Aayush\AppData\Local\Temp\ipykernel_59096\759912295.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i]=df['FlightNumber'][i-1]+10

In [34]:
df.head()

,From,To,FlightNumber,Delay_1,Delay_2,Delay_3,Airline
0,delhi,Hyderabad,10045,23.000000,47.000000,53.138889,Air India
1,Lucknow,Kochi,10055,53.138889,53.138889,53.138889,Indigo
2,delhi,Chandigarh,10065,24.000000,43.000000,87.000000,Go Air
3,Mumbai,Hyderabad,10075,13.000000,53.138889,53.138889,Indigo
4,Chennai,Kolkata,10085,67.000000,32.000000,53.138889,Vistara

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From          5 non-null      object
 1   To            5 non-null      object
 2   FlightNumber  5 non-null      int32
 3   Delay_1       5 non-null      float64
 4   Delay_2       5 non-null      float64
 5   Delay_3       5 non-null      float64
 6   Airline       5 non-null      object
dtypes: float64(3), int32(1), object(3)
memory usage: 392.0+ bytes